{
    "episode": {
        "title": "Product Owner: conheça as 4 características fundamentais",
        "description": "Conhecimentos de negócio, autonomia, disponibilidade e comunicação estão entre as principais skills do cargo de Product Owner",
        "number": "1x01",
        "keyword": "office",
        "url": "https://blog.impulso.network/product-owner/",
        "slug": "product-owner-conheca-as-4-caracteristicas-fundamentais"
    },
    "text": "Em times de desenvolvimento de software que seguem Metodologias Ágeis, a função de Product Owner (PO) é imprescindível. Trata-se de um cargo extremamente estratégico para as empresas, já que é essa pessoa quem ficará responsável pelo retorno sobre o investimento (ROI). Por isso, a figura do PO também é conhecida por ser stakeholder do projeto.\n\nAo mesmo tempo em que são peças-chave para as empresas, Product Owners também têm muito contato com as pessoas desenvolvedoras. Afinal, precisam criar e manter atualizado o product backlog, que é o documento que contém as funcionalidades que o sistema precisa apresentar. Nesse sentido, quem é PO precisa ter claro em mente qual é o produto a ser desenvolvido pelo time e se esse produto está dentro da visão da empresa.\n\nLeia também: Quadro Scrum: o que você deve saber para atuar em um projeto de software com este framework\n\nO dono ou a dona de um produto em um projeto de software funcionam aos moldes de um elo entre a empresa e o time de desenvolvimento. Essa pessoa define o produto que será desenvolvido por meio do product backlog, onde ainda devem estar destacadas as prioridades de cada sprint. Também cria metas e motiva a equipe caso o escopo se acumule nas semanas anteriores à entrega do produto.\n\nQuem é Product Owner ajuda o cliente a entender o que pode trazer mais retorno em cada momento do projeto.\n\nA ideia é que se consiga maximizar o valor do produto que está sendo construído pela equipe, como define o The Scrum Guide. Tudo isso sem abrir mão da integridade conceitual das novas funcionalidades, bugs ou melhorias do produto em desenvolvimento e ainda fazendo refinamentos constantes no backlog.\n\nPor ter o poder de decisão, este é um cargo ocupado por uma só pessoa, principalmente para não gerar dúvidas entre integrantes do projeto. Além do time de desenvolvimento, a função de PO também é complementada pelo Scrum Master em um time Scrum (ou time que use um framework similar).\n\nO papel de Product Owner é relativamente novo. Para não deixar dúvidas a respeito dos pré-requisitos para seguir essa carreira, o site Método Ágil destaca as quatro características abaixo como fundamentais para a figura do PO em times de desenvolvimento de software. Veja quais são e conheça a nossa visão sobre elas:\n\nPara além de entender sobre desenvolvimento de software, gerir o backlog de um projeto também exige de Product Owners conhecimentos sólidos de negócio. Gerenciamento de projetos e marketing são outras áreas afins que podem beneficiar quem é PO.\n\nSomente com uma visão de business é possível garantir o desenvolvimento de um produto alinhado aos interesses da empresa, capaz de diferenciar-se de concorrentes e ainda de trazer inovação. Nem sempre esse conhecimento é de fácil acesso de profissionais da tecnologia, sendo, portanto, importante buscar formação complementar.\n\nProduct Owner geralmente é aquela pessoa de confiança da empresa, que representa os interesses de todo um comitê. Por outro lado, ninguém pode tirar a autoridade que PO`s precisam ter, nem mesmo os profissionais C level, sobre o que precisa ser feito em um projeto de software.\n\nTambém cabe ao PO e só ao PO a responsabilidade pela qualidade das entregas. Essa pessoa é a única que pode marcar uma história como concluída no backlog do projeto. Nesse sentido, é válido destacar a necessidade de haver autonomia para exercer o cargo de dono ou dona do projeto, que também deve ser alguém por perfil analítico, crítico e de liderança.\n\nLeia também: Quais são as características do profissional do futuro na tecnologia?\n\nQuem é PO precisa criar e manter um backlog de produto transparente e visível para todas as pessoas que integram a equipe. Paralelamente a isso, deve mostrar-se disponível na maior parte do tempo para discutir uma issue ou tirar alguma dúvida. Como é alguém que executa uma função a intermediária, a disponibilidade também precisa existir para a empresa, o que exige organização das demandas diárias de trabalho.\n\nHabilidades em comunicação oral e escrita são igualmente de suma importância para quem é Product Owner. É preciso, ao mesmo tempo, saber expressar-se em reuniões com o time de desenvolvimento e com a empresa, além de escrever de forma clara os itens do backlog para que sejam facilmente compreendidos. Em resumo, quem é PO deve demonstrar consistência e firmeza nas ações, sendo a comunicação uma das vias para isso.\n\nBaixe gratuitamente: Conheça todos os canais de troca de conhecimento e vagas de trabalho na tecnologia\n\nTransitar entre os dois mundos, o do cliente ou da empresa e do time de desenvolvimento, é uma atividade desafiadora. Afinal, os feedbacks (e cobranças, claro) existem dos dois lados. Nesse contexto, essa função assemelha-se a um facilitador, podendo ser ao mesmo tempo extremamente satisfatória, gratificante e recompensadora.\n\nNa comunidade da Impulso Network, para além de divulgar periodicamente oportunidades para Product Owners, promovemos capacitações específicas, fornecemos descontos para a participação em eventos especializados e ainda incentivamos discussões acerca dos desafios dessa e de outras funções. Os nossos canais podem ser o espaço que você buscava para fazer contatos, ensinar e aprender sobre carreira na tecnologia. Experimente aqui.\n\nCaso tenha ficado com alguma dúvida ou queira contribuir com a discussão sobre ser PO, compartilhe o seu relato conosco pelos comentários.",
    "sentences": [
        "Em times de desenvolvimento de software que seguem Metodologias Ágeis, a função de Product Owner (PO) é imprescindível.",
        "Trata-se de um cargo extremamente estratégico para as empresas, já que é essa pessoa quem ficará responsável pelo retorno sobre o investimento (ROI).",
        "Por isso, a figura do PO também é conhecida por ser stakeholder do projeto.  Ao mesmo tempo em que são peças-chave para as empresas, Product Owners também têm muito contato com as pessoas desenvolvedoras.",
        "Afinal, precisam criar e manter atualizado o product backlog, que é o documento que contém as funcionalidades que o sistema precisa apresentar.",
        "Nesse sentido, quem é PO precisa ter claro em mente qual é o produto a ser desenvolvido pelo time e se esse produto está dentro da visão da empresa.  Leia também: Quadro Scrum: o que você deve saber para atuar em um projeto de software com este framework  O dono ou a dona de um produto em um projeto de software funcionam aos moldes de um elo entre a empresa e o time de desenvolvimento.",
        "Essa pessoa define o produto que será desenvolvido por meio do product backlog, onde ainda devem estar destacadas as prioridades de cada sprint.",
        "Também cria metas e motiva a equipe caso o escopo se acumule nas semanas anteriores à entrega do produto.  Quem é Product Owner ajuda o cliente a entender o que pode trazer mais retorno em cada momento do projeto.  A ideia é que se consiga maximizar o valor do produto que está sendo construído pela equipe, como define o The Scrum Guide.",
        "Tudo isso sem abrir mão da integridade conceitual das novas funcionalidades, bugs ou melhorias do produto em desenvolvimento e ainda fazendo refinamentos constantes no backlog.  Por ter o poder de decisão, este é um cargo ocupado por uma só pessoa, principalmente para não gerar dúvidas entre integrantes do projeto.",
        "Além do time de desenvolvimento, a função de PO também é complementada pelo Scrum Master em um time Scrum (ou time que use um framework similar).  O papel de Product Owner é relativamente novo.",
        "Para não deixar dúvidas a respeito dos pré-requisitos para seguir essa carreira, o site Método Ágil destaca as quatro características abaixo como fundamentais para a figura do PO em times de desenvolvimento de software.",
        "Veja quais são e conheça a nossa visão sobre elas:  Para além de entender sobre desenvolvimento de software, gerir o backlog de um projeto também exige de Product Owners conhecimentos sólidos de negócio.",
        "Gerenciamento de projetos e marketing são outras áreas afins que podem beneficiar quem é PO.  Somente com uma visão de business é possível garantir o desenvolvimento de um produto alinhado aos interesses da empresa, capaz de diferenciar-se de concorrentes e ainda de trazer inovação.",
        "Nem sempre esse conhecimento é de fácil acesso de profissionais da tecnologia, sendo, portanto, importante buscar formação complementar.  Product Owner geralmente é aquela pessoa de confiança da empresa, que representa os interesses de todo um comitê.",
        "Por outro lado, ninguém pode tirar a autoridade que PO`s precisam ter, nem mesmo os profissionais C level, sobre o que precisa ser feito em um projeto de software.  Também cabe ao PO e só ao PO a responsabilidade pela qualidade das entregas.",
        "Essa pessoa é a única que pode marcar uma história como concluída no backlog do projeto.",
        "Nesse sentido, é válido destacar a necessidade de haver autonomia para exercer o cargo de dono ou dona do projeto, que também deve ser alguém por perfil analítico, crítico e de liderança.  Leia também: Quais são as características do profissional do futuro na tecnologia?  Quem é PO precisa criar e manter um backlog de produto transparente e visível para todas as pessoas que integram a equipe.",
        "Paralelamente a isso, deve mostrar-se disponível na maior parte do tempo para discutir uma issue ou tirar alguma dúvida.",
        "Como é alguém que executa uma função a intermediária, a disponibilidade também precisa existir para a empresa, o que exige organização das demandas diárias de trabalho.  Habilidades em comunicação oral e escrita são igualmente de suma importância para quem é Product Owner.",
        "É preciso, ao mesmo tempo, saber expressar-se em reuniões com o time de desenvolvimento e com a empresa, além de escrever de forma clara os itens do backlog para que sejam facilmente compreendidos.",
        "Em resumo, quem é PO deve demonstrar consistência e firmeza nas ações, sendo a comunicação uma das vias para isso.  Baixe gratuitamente: Conheça todos os canais de troca de conhecimento e vagas de trabalho na tecnologia  Transitar entre os dois mundos, o do cliente ou da empresa e do time de desenvolvimento, é uma atividade desafiadora.",
        "Afinal, os feedbacks (e cobranças, claro) existem dos dois lados.",
        "Nesse contexto, essa função assemelha-se a um facilitador, podendo ser ao mesmo tempo extremamente satisfatória, gratificante e recompensadora.  Na comunidade da Impulso Network, para além de divulgar periodicamente oportunidades para Product Owners, promovemos capacitações específicas, fornecemos descontos para a participação em eventos especializados e ainda incentivamos discussões acerca dos desafios dessa e de outras funções.",
        "Os nossos canais podem ser o espaço que você buscava para fazer contatos, ensinar e aprender sobre carreira na tecnologia.",
        "Experimente aqui.  Caso tenha ficado com alguma dúvida ou queira contribuir com a discussão sobre ser PO, compartilhe o seu relato conosco pelos comentários."
    ],
    "image": {},
    "docs": "/var/www/impulso/lab/bots/../episodes/product-owner-conheca-as-4-caracteristicas-fundamentais/product-owner-conheca-as-4-caracteristicas-fundamentais.md"
}